In [1]:
#Data cleaning for Rolled Up Restaurants Dataset

#import libraries and dataset
import pandas as pd
from pandas_profiling import ProfileReport

data = pd.read_csv("C:\\Users\\HP\\Downloads\\Restaurants_Raw.csv")

In [2]:
#profile the data
profile= ProfileReport(data, title="profile")
profile.to_file("restaurant_report.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [3]:
#drop the columns not required for our analysis

data = data.drop(columns=['CAMIS', 'BUILDING'])

data.head()

                    DBA           BORO                       STREET  ZIPCODE
0     MELANY RESTAURANT       Brooklyn              FLATBUSH AVENUE  11226.0
1              ING CAFE      Manhattan       AVENUE OF THE AMERICAS  10036.0
2                   NaN  Staten Island                  PAGE AVENUE  10309.0
3      KOSSARS & BEYOND      Manhattan                 GRAND STREET  10002.0
4  CITI FIELD STAND 321         Queens  126TH ST & ROOSEVELT AVENUE      NaN

In [4]:
datatypes = data.dtypes

datatypes

DBA         object
BORO        object
STREET      object
ZIPCODE    float64
dtype: object

In [5]:
#handle missing and null values

for c in data.columns:
    miss = data[c].isnull().sum()
    if miss>0:
        print("{} has {} missing value(s)".format(c,miss))
    else:
        print("{} has NO missing value!".format(c))

DBA has 1558 missing value(s)
BORO has NO missing value!
STREET has 27 missing value(s)
ZIPCODE has 459 missing value(s)

In [6]:
data.shape

(27975, 4)

In [7]:
#drop rows with missing values to ensure we have clean data

data.dropna(axis='index', how ='any', inplace=True)

data.shape

(25991, 4)

In [8]:
#check if all missing values have been removed

for c in data.columns:
    miss = data[c].isnull().sum()
    if miss>0:
        print("{} has {} missing value(s)".format(c,miss))
    else:
        print("{} has NO missing value!".format(c))

DBA has NO missing value!
BORO has NO missing value!
STREET has NO missing value!
ZIPCODE has NO missing value!

In [9]:
#change datatype to match our desired output

convert_dict = {'DBA': str,'BORO': str,'STREET': str,'ZIPCODE': int }

In [10]:
data = data.astype(convert_dict)

data.dtypes

DBA        object
BORO       object
STREET     object
ZIPCODE     int32
dtype: object

In [11]:
#concatenate two columns to form one address column 

data['Address'] = data['STREET'].str.cat(data['BORO'],sep=", ")

data.head()

,DBA,BORO,STREET,ZIPCODE,Address
0,MELANY RESTAURANT,Brooklyn,FLATBUSH AVENUE,11226,"FLATBUSH AVENUE, Brooklyn"
1,ING CAFE,Manhattan,AVENUE OF THE AMERICAS,10036,"AVENUE OF THE AMERICAS, Manhattan"
3,KOSSARS & BEYOND,Manhattan,GRAND STREET,10002,"GRAND STREET, Manhattan"
5,PORTAL LATINO RESTAURANT,Brooklyn,SMITH STREET,11201,"SMITH STREET, Brooklyn"
6,UNREGULAR PIZZA,Manhattan,4 AVENUE,10003,"4 AVENUE, Manhattan"

In [12]:
#drop the columns as we have already combined the data into a address

data = data.drop(columns=['BORO', 'STREET'])

In [13]:
#add columns, since we do not have phn no url and other details we add it as not available
#this step will help remove issues of missing values when all other data sets are combined

data['Category'] = 'Restaurant'
data['Phn_No'] = 'Not Available'
data['URL'] = 'Not Available'
data['Additional_Details'] = 'Not Available'
data.head()

,DBA,ZIPCODE,Address,Category,Phn_No,URL,Additional_Details
0,MELANY RESTAURANT,11226,"FLATBUSH AVENUE, Brooklyn",Restaurant,Not Available,Not Available,Not Available
1,ING CAFE,10036,"AVENUE OF THE AMERICAS, Manhattan",Restaurant,Not Available,Not Available,Not Available
3,KOSSARS & BEYOND,10002,"GRAND STREET, Manhattan",Restaurant,Not Available,Not Available,Not Available
5,PORTAL LATINO RESTAURANT,11201,"SMITH STREET, Brooklyn",Restaurant,Not Available,Not Available,Not Available
6,UNREGULAR PIZZA,10003,"4 AVENUE, Manhattan",Restaurant,Not Available,Not Available,Not Available

In [14]:
#rename columns

data.rename(columns = {'Category':'CATEGORY', 'DBA':'NAME', 'Address':'ADDRESS', 'Zipcode':'ZIPCODE','Phn_No':'PHONE NO.', 'Additional_Details':'ADDITIONAL DETAILS'}, inplace = True)
data.head()

,NAME,ZIPCODE,ADDRESS,CATEGORY,PHONE NO.,URL,ADDITIONAL DETAILS
0,MELANY RESTAURANT,11226,"FLATBUSH AVENUE, Brooklyn",Restaurant,Not Available,Not Available,Not Available
1,ING CAFE,10036,"AVENUE OF THE AMERICAS, Manhattan",Restaurant,Not Available,Not Available,Not Available
3,KOSSARS & BEYOND,10002,"GRAND STREET, Manhattan",Restaurant,Not Available,Not Available,Not Available
5,PORTAL LATINO RESTAURANT,11201,"SMITH STREET, Brooklyn",Restaurant,Not Available,Not Available,Not Available
6,UNREGULAR PIZZA,10003,"4 AVENUE, Manhattan",Restaurant,Not Available,Not Available,Not Available

In [15]:
#rearrange columns to match desired output

data = data[['CATEGORY', 'NAME', 'ADDRESS', 'ZIPCODE','PHONE NO.', 'URL', 'ADDITIONAL DETAILS']]

data

,CATEGORY,NAME,ADDRESS,ZIPCODE,PHONE NO.,URL,ADDITIONAL DETAILS
0,Restaurant,MELANY RESTAURANT,"FLATBUSH AVENUE, Brooklyn",11226,Not Available,Not Available,Not Available
1,Restaurant,ING CAFE,"AVENUE OF THE AMERICAS, Manhattan",10036,Not Available,Not Available,Not Available
3,Restaurant,KOSSARS & BEYOND,"GRAND STREET, Manhattan",10002,Not Available,Not Available,Not Available
5,Restaurant,PORTAL LATINO RESTAURANT,"SMITH STREET, Brooklyn",11201,Not Available,Not Available,Not Available
6,Restaurant,UNREGULAR PIZZA,"4 AVENUE, Manhattan",10003,Not Available,Not Available,Not Available
...,...,...,...,...,...,...,...
27970,Restaurant,MC BAKERY AND COFFEE SHOP II,"JEROME AVENUE, Bronx",10468,Not Available,Not Available,Not Available
27971,Restaurant,HENO HENO,"WEST 46 STREET, Manhattan",10036,Not Available,Not Available,Not Available
27972,Restaurant,A & C GUYANA BAKERY & RESTAURANT,"UTICA AVENUE, Brooklyn",11203,Not Available,Not Available,Not Available
27973,Restaurant,NEW WIN HING INC,"BAY STREET, Staten Island",10305,Not Available,Not Available,Not Available
27974,Restaurant,L'ARGOT,"HAMILTON PLACE, Manhattan",10031,Not Available,Not Available,Not Available

In [16]:
#convert to csv
data.to_csv('C:\\Users\\HP\\Downloads\\Restaurants.csv', index=False)